<template>

         <!--about-jewelry-container-->
         <div class="about-jewelry-container">
            <!--image-jewelry-->
            <div class="image-jewelry">
                <img src="../assets/img/Cartier-love-ring-16-270x270.png" alt="Кольцо">
            </div><!--image-jewelry-->
            
            <!--about-jewelry-->
            <div class="about-jewelry">
                <p>
                    Драгоценные металлы всегда были индикатором достатка и высокого социального положения. 
                    Только помните, что украшения всегда были очень недоступным товаром для простых людей. 
                    Только короли и императоры, жрецы и пираты могли владеть драгоценностями. 
                    Древние считали, что драгоценные камни всегда обладали какой-то магической силой, поэтому ювелирные украшения были так редки и непомерно дороги. 
                    Есть два вида украшений – камни и металлы. 
                    Очевидно, что оба они уникальны из-за их внешнего вида. 
                    Похоже, что наше фанатичное желание иметь драгоценности — результат каких-то психологических особенностей. 
                    Помните, что варварам нравилось все блестящее и яркое, даже если оно было абсолютно бесполезным. 
                    Вероятно, мы унаследовали эту слабость. 
                    Но вы знаете, что украшения дают ощущение свободы и самобытности.
                </p>

                <p>
                    Мы предлагаем вам уникальный товар, потому что наш продукт - настоящее сокровище. 
Если вы настоящий фанат, вам понравится. 
У нас огромное разнообразие по сравнению со всеми нашими конкурентами. 
Наша коллекция подобна морской жемчужине среди простых камней. 
Наши преданные клиенты заметили, что наша продукция является показателем истинного, элегантного вкуса.
                </p>
                <p>
                    Уверены, что высокое качество и приемлемая цена наших украшений приятно удивят вас. 
Наши драгоценные камни и металлы действительно надежны и модны. 
В настоящее время мода очень важна для многих клиентов, поэтому мы всегда в курсе последних тенденций моды. 
Наша продукция представляет собой сочетание классического и современного стиля; мы можем удовлетворить любые требования клиентов, поэтому у нас так много поклонников. 
Вы всегда будете популярны с нашими украшениями; Волшебный блеск наших изделий принесет вам удачу!
                </p>
                <p>
                    Если вы хотите быть более элегантным и стильным, вам стоит примерить наши товары, они того стоят.
                </p>

 
            </div><!--about-jewelry-->
         </div><!--about-jewelry-container-->

  </template>

<script>
export default {
  name: 'HelloWorld',
  props: {
    msg: String
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style>

.about-jewelry-container {
  display: flex;
  justify-content: center;
  align-items: center;
  flex-wrap: wrap;
  width: 1200px;
  max-width: 100%;
  /*min-width: 0;*/
  /*height: 340px;*/
  max-height: 100%;
  height: auto;
  margin: 40px 0 20px 0;
  /*padding: 10px 0 10 px 0;*/
  /*border: 2px solid rgb(32, 29, 228);*/
}

.image-jewelry {
  display: flex;
  justify-content: center;
  align-items: center;
  width: 300px;
  height: 280px;
  /*border: 3px solid rgb(134, 199, 31); */
}

.image-jewelry > img{
  max-width: 100%;
  width: 100%;
  height: 100%;
  /*border: 3px solid rgb(134, 199, 31); */
}

.about-jewelry {
  width: 800px;
  max-width: auto;
  min-width: auto;
  /*height: 340px;*/
  height: auto;
  /*max-height: auto;*/
  max-height: 100%;
  padding: 0 10px 0 10px;
  /*border: 2px solid rgb(205, 29, 228);*/
}

.about-jewelry > p {
  margin: 5px 5px 5px 5px;
  /*padding: 10px 0 10 px 0;*/
  /*border: 2px solid rgb(205, 29, 228);*/
}


</style>
